In [58]:
import glob
import pandas as pd

In [59]:
files = glob.glob('files_to_process/*.csv')
files

['files_to_process/D4.csv',
 'files_to_process/D5.csv',
 'files_to_process/D2.csv',
 'files_to_process/D3.csv',
 'files_to_process/D1.csv']

In [60]:
len(files)

5

In [61]:
df = []

for file in files:
    data = pd.read_csv(file, sep = '|', names = ['Name', 'Age', 'Height'])
    df.append(data) # append data together

combined_df = pd.concat(df)
combined_df

    Name  Age  Height
0   Name  Age  Height
1   Nana   10     127
0   Name  Age  Height
1   Mark   10     147
0   Name  Age  Height
1  Nueng   20     176
0   Name  Age  Height
1   Chew   13     165
0   Name  Age  Height
1  Natty   15     157

In [62]:
df = []

for file in files:
    data = pd.read_csv(file, sep = '|', header = 0)
    df.append(data) # append data together

combined_df = pd.concat(df)
combined_df

    Name  Age  Height
0   Nana   10     127
0   Mark   10     147
0  Nueng   20     176
0   Chew   13     165
0  Natty   15     157

In [63]:
combined_df.head(2)

   Name  Age  Height
0  Nana   10     127
0  Mark   10     147

In [64]:
combined_df.shape

(5, 3)

In [65]:
combined_df.reset_index(inplace = True)

In [66]:
combined_df

   index   Name  Age  Height
0      0   Nana   10     127
1      0   Mark   10     147
2      0  Nueng   20     176
3      0   Chew   13     165
4      0  Natty   15     157